[
    {
        "id": 1,
        "title": "Start of the Writing Journey",
        "content": "“I told myself I should write something”, so here I am. Sitting at my desk, cluttered with memories, used utensils, plates needing washing, reminders for the future, ideas wanting to be explored and useless junk. All of this stuff I leave to myself as reminders, but I never act on them. So what's the point? Well, the point is one day I will eventually get to it, so I leave it in my life as a daily reminder. Even I think to myself, maybe I should just declutter my life so I can start focusing on the stuff that matters, like making myself job ready, enjoying the vastness and craziness that life has to offer or even doing the stuff that I must get done, like my university work, or finding a goddamn job. But where do my priorities lie at the moment? Making myself happy. They say do what makes you happy, but what makes me happy is the small moments in life, the ones you don't plan, but it isn't reliable. They say being happy is putting hard work into something and hoping that the return is worth it. But I'm never happy putting in the work and rarely do I even reach that point where the payoff is ever worth the effort, which also isn't very reliable. I'm at the first step again. Perhaps I just need to adjust my goals? Being happy is the outcome, what are the steps to get there? Beats the fuck out of me, that's something that future me can worry about. Ah… such is the dilemma of life. ",
        "date": "2024-02-04",
        "tags": [
            "life",
            "thoughts",
            "philosophy"
        ]
    },
    {
        "id": 2,
        "title": "Cat and I",
        "content": "I've always been one to be comfortable around, to let others be themselves around me. It has always been my goal in life, because I love to see people live out their best lives and it's something I've always wanted, to be able to just be myself no matter what circumstance, who I'm around, where I'm at. Part of this desire is also to analyse and understand the inner workings of the child at heart. With this said, my cat is a fucking chore and a half. I dont understand him. Ever since he was little he had always been rough, biting, scratching, I think it's in a playful matter because he never hisses. I have tried to play his game, pet him when he wants to be pet, be playful with him, but I can never tell if he is having fun or not. He doesn't communicate what he wants, sometimes I'll pet him and then a few seconds later he leaves without a moments notice. It's like he decided I'm not good at petting. Sometimes I'll pet him because I think he likes it but he ends up biting me, trying to tell me to stop. Sometimes he'll hop on my bed, lie down next to me, and then breathes heavily when I touch him and move away. Why did you even come up next to me? Why are you never comfortable to be around me? Although sometimes he'll sleep next to me, on the opposite side of the bed from me, lies down and keeps his paw touching my foot. My human foot touching his little cat paw. Perhaps this is the distance that he is most comfortable with. The distance where we both do not necessarily get in each other's way, the distance where we do not bother each other and the distance where we are both most comfortable to be around. The idea that we are in two separate worlds mentally, he is stuck in this god forbidden house with nowhere for comfort and my world where I am stuck in a rut not sure what to do with my life, but we are still connected, physically. This is the feeling I get with my cat. We will never understand each other's lives, but this is the closest I'll ever be with my cat and I'll have it no other way.",
        "date": "2023-02-04",
        "tags": [
            "cat",
            "thoughts",
            "wholesome"
        ]
    },
    {
        "id": 3,
        "title": "Something Lost",
        "content": "Walking through history gives me a glimpse into the past. It's crazy how the mind can conjure up a fantasy within the span of 3 seconds that feels like an eternity and then suddenly you snap back to reality. The new and barely used skate park past the McDonalds behind the hill and the highway speaks volumes of what used to be, and what could have been. Despite it being in perfect condition, it has barely any signs of use. I pass by here quite often, and quite often there is nobody there. A shame really. Broken tools tossed about tainting the perfectness, lost socks drenched, dried and drenched again with the spoils of the clouds and graffiti of those with a knack for art, wanting to leave a message for future generations or just tomfoolery. Now a barren skate park with little hopes of life, perhaps there is a decline in skating, or a rise of unfamiliarity with our neighbours. Perhaps the location is bad, or there is a better skate park nearby? Perhaps it is not a good skatepark by any means. Whatever it is, it's sad it isn't being used, but what can you do?",
        "tags": [
            "passage of time",
            "struggle",
            "reminiscing"
        ]
    },
    {
        "id": 4,
        "title": "Psychonauts",
        "content": "We're going into a deep dive into the mind of a mentally struggling REDACTED. Clearly there is something wrong with them, REDACTED SENTENCE! What is up with that? I guess that's what we're going to try and figure out. Jumping into someone's head without inherent permission should be illegal, it's like watching someone undress and shower without them knowing. I feel terrible, yet slighting aroused at the thought, not the undressing part but the idea of undressing the mind. Smelling salts in hand, ready as I'll ever be. You never really get used to this feeling of entering the unknown, but it keeps me on my toes. If I ever got used to this, I think that would mean I am insane, or on the path to be. Being complacent with something as crazy as this would make anyone mad, especially having to go back to an ordinary life. Best to be happy with the small moments. In a snap, squinting at the whiteness, the rushing of blood towards his feet, buzzing sound in my ear, I wake up feeling uneasy.",
        "tags": [
            "psychonaut",
            "mind",
            "psychology",
            "psyche"
        ]
    },
    {
        "id": 5,
        "title": "Staying Awake",
        "content": "I can't sleep but I don't want to sleep, I'm not even sure what I want. It's like my eyes are craving the deep darkness of nothingness, but are tied to a rope, dangling above the abyss unable to free themselves into the vastness of the empty, being teased of all that they desire. All it may take is a quiet moment, no thoughts and that one action of closing the mind to the feeling of sight, but the hip feels a little uncomfortable, lips too dry and needing attention, throat playing up, sensation of floating, brain playing a million and one games at the same time. It's no wonder I can't sleep. ",
        "tags": [
            "sleep",
            "struggle",
            "psyche"
        ]
    },
    {
        "id": 6,
        "title": "Forgetting",
        "content": "There's a moment that sticks with me, a beautiful, maybe a little angsty comment on my thoughts or surroundings, maybe a little sad, but it is a moment that I would rather not forget. Usually my initial thoughts are to jot it down because it would be nice to read in the future… but a few seconds later the thought vanishes without a trace, like leaves in the wind, like a fish swimming downstream, like a fleeting moment passing you by as you watch, but there is nothing you can do to catch the memory, and remember it. I'll try my best to remember what I had just thought, but the thought never returns. As much as you chase the feeling, it just never leaves any traces. Why is it always like this? This could be caused by small things like eating shit all the time, not getting enough sleep or exercise, not practicing my memory or recall. Sometimes I think this is an issue that can be fixed, but I just have to live with it. Gotta move on from that memory OR I can write it down as soon as it comes to mind. I like to do either of these. Maybe I should try more meditation!!",
        "tags": [
            "struggle",
            "psychology",
            "memory"
        ]
    },
    {
        "id": 7,
        "title": "WHAT DO I FIND FUN IN WRITING?",
        "content": "It's the action of getting sucked into a world. Letting the imagination run wild with theories, with ideas, with possibilities and endlessness, while also not getting too lost as to stray from the original intent. I love stories that make sense, that establish rules and play by them. I love feeling the emotions of the characters, I love tension of knowing more than the characters, and the sweet release.",
        "tags": [
            "writing",
            "psyche",
            "questions"
        ]
    },
    {
        "id": 8,
        "title": "Slow Days",
        "content": "The slow drag of time, like dragging the ball and chain up a mountain, like trying to run through waist deep water, like trying to drink a beverage with the consistency of honey, like a never ending carousel that spins and sings endlessly endlessly, not changing in the slightest. Droning buzz of laptop fans heating the room ever so slightly, wistful swaying of the trees, that one crusty leaf from the dying, orange tree hanging on for dear life, perhaps even wishing to die, the taxidermied moth sticking to the window, the pitter patters of the quiet keyboard strokes, the sensation in the knee that can only be described as a non-painful pressure, the desire to regain control of facial expressions, the ever slightly obnoxious flicker and twitch of the eyelid. What do these details all have in common? It wants my eyes to close, to rest a little bit, to day dream about nothing important, to get away from all of this.",
        "tags": [
            "questions",
            "psyche",
            "real life"
        ]
    },
    {
        "id": 9,
        "title": "Brain Fog",
        "content": "What is it anyways? It's like the slowing down of the mind, a dredge of unimportant details, unsuspecting, useless thoughts and ideas and people and emotions; it cannot keep up with whatever is thrown at it. Perhaps not enough stimulation and it has regressed, perhaps it is slowly degrading with age, or perhaps it is not being fed enough nutrients or oxygen. There's no way I can tell right now, but it's definitely annoying. Sometimes you wish you could control your brain the way you do your body, but stuff like this gets in the way. It's strange to think about, despite being able to control your body, you never do have full control of your mind. You can't focus for the life of you; you just want to sleep when there are important things needing to be done, you just want to eat and consume and spend your time on eventful nothings when you could be creating, experiencing, inventing, connecting with the world and it's inhabitants.",
        "tags": [
            "questions",
            "psyche",
            "real life"
        ]
    },
    {
        "id": 10,
        "title": "Obsessions",
        "content": "Why am I so obsessed with writing what I have recently done? I do this with some emotions, with some experiences in my journaling, logging some movies, animes, and other media that I consume. It's a strange obsessions that I didn't really think about until I read online how ridiculous it sounds. I know “why” I think I do it, it's because I don't want to forget my thoughts about them, or maybe I just want to exercise that describing mechanism that goes on in my brain. But part of it is also because of ego, sometimes I'll re-read things I have written, just to be like “wow I wrote this?”, to get inspiration from it I guess. Sometimes I even hope that people will stumble upon it, and read my thoughts on things and be like “this guys pretty smart I guess”. It's all about impressions with me. Or maybe even about validation, I just want people to know that I love what I do. Inherently, is any of this a bad thing? Or rather, do I think this is a bad thing (in case anyone is reading this)? Like, I don't think so. This is just how I function. Like I always say, if I change the core of me, I'm also changing who I am as a person, do I really want that? I am happy to be who I am today. But I am also now realising that it is also alright to change. But is it worth the effort, and who am I changing for, is the real question.",
        "tags": [
            "questions",
            "psyche",
            "real life"
        ]
    },
    {
        "id": 10,
        "title": "Isolation",
        "content": "Being isolated is not fun. The idea that you have nobody to lean on, nobody to look to, nobody but yourself. A worthless piece of shit that amounts to nothing but a corpse in the river, a fly plastered to the front of a train, a motionless blood splatter across the wall. The feeling that it will never be alright despite what you may think, and the incurable loneliness will only get worse, leaving you paralysed and unable to adapt, only making matters worse. I think nowadays the feeling has slowly left me. Social anxiety has also left me. I'm a much healthier person nowadays. In fact, I love being alone. It recharges my brain. One thing to note is that solitude and loneliness are two different things. I am not lonely anymore, I have friends to be around and people who care about me. Solitude is the act of being alone, loneliness is the feeling of being alone. They sound similar, but solitude you can be alone and not feel lonely, and loneliness you can be around people but still feel alone.",
        "tags": []
    },
    {
        "id": 11,
        "title": "Memories",
        "content": "God, memory is a funny thing. Okay lets start from the top, but I'll try not to get too side tracked so I don't forget the entire premise but it's worth it (I hope!). I'm at work, cake was mentioned, but brought by someone I don't know. I was told to introduce myself to this guy who brought the cake. A co-worker (let's call him Nathan) was also meant to say hello as well but didn't lol. So I just followed his lead, took some cake, and as I was walking out the door, I was stopped by my Supervisor who asked if I had introduced myself yet. I said no, because well, I didn't want to interupt as they were already having a conversation. She introduced me, (Greg) (someone on long service leave?) and (Paulie), who is replacing that guy who's on leave and was actually a part of our team previously. He said I looked familiar, had a bunch of laughs because of the casual racism jokes, and then mentioned that I was related to (Michael) and had some laughs because it took him a while to realise who that was (someone pretty big in the IT field at this place), and that he had been on long service leave for too long that he's forgetting everyone. Anyways, I left that conversation, and ended up thinking about it because I enjoyed the laughs that were had, and spoke to myself under my breath, thinking about that exact interaction I just had a few seconds/minutes ago. It made me wonder, I wonder if (Nathan) was wondering what I was thinking about because he looked my direction when I spoke under my breath, and that lead me to think about what people think about in general, whether they like to think about their previous conversations like I do. And then… I lost the sauce, now I can't remember my initial thought that I wanted to share. It was something about... OHHH yes. Thoughts attached to emotions. When I think about conversational stuff, I think about previous conversations that made me happy, in the same way I guess. And then the feeling of being isolated, and bringing back memories of my schooling, watching the jungle gym of little monkeys that were my classmates, observing everyone else have fun while I was just standing there not knowing what to do. A little too over stimulated by the obnoxiously loud noises coming from that general direction and the amount of people. It feels weird looking back on it. I was a really quiet kid, but I also talked a lot about things I really liked with the people around me. I remember a classmate (Luke) listening to me when I was younger, maybe not the most interested but always gave me the attention, time of day. I will always appreciate that. BUT, I digress. I ended up thinking about a fun little scenario. What if you've already lived everything in your life, but the emotions and feelings that you feel everyday are just memories being played back to you? What if you're already dead, and you're just a machine experiencing what the person you just experienced was? What if you are an AI learning from these emotions? Reliving every single second, to understand what it is like to be human… What a nightmare. If the machine retained all of the information it took, then I reckon it would surpass being a human. What if our legacy lives on through our inventions? What if our evolution was to put ourselves into mechanical bodies, to not have to limit ourselves to our human bodies? At what point would that even be worth it, to be immortal without stimulation or entertainment. What would become of us then? Well, create yourself like that. God created us in his image, so we can create ourselves back into our original image.",
        "tags": []
    },
    {
        "id": 12,
        "title": "Warm Beats and Spine Chilling Wind",
        "content": "It was a crazy night. A normal night of Parramatta Lanes interrupted by a slow coming of rain to a mini storm, to a windy, cold but humid night. Amongst all the chaos of people running around to find shelter, umbrellas getting caught on the wrong side of the wind and destroying poor old men and people sharing umbrellas, was the shimmering lights, the mellow tones and soft kicks heard and seen from a distance, of a lovely neo soul band playing their best despite most people walking off to keep themselves dry. Picture-esque band is almost the perfect word, female protag on the vocals capturing the show, and the perfect side characters to back them up, 2 black back up singers to sing the harmonies, the articulate asian on the guitars not getting the memo on the outfit wearing a tracksuit jacket and joggers, average brownish guy on the drums, white guy that dresses nicely on the bass a little nonchalant and the cool white guy on the keys. They played some nice soul, very jazzy but calculated jazz in the sense that they didn't actually improvise it seemed like. Played like there was nobody there, and obviously be me like a moth to a flame to any sort of soul/jazz music, and a couple of others there as well with a passion for music. There was this somewhat homeless looking tall slender black fella with normal looking clothes and a hoodie, that was so entranced by the music, and possibly the girl singing. \n All I could think of was the dichotomy of the situation. It was still sprinkling, harsh weather to be enjoying this kind of music, but the cold, clothes piercing wind contrast with the incredible, almost warming music and the scenic lights behind the band and the fitting, I could almost fall into a trance just listening to the music and being in that very moment. I like to imagine what was going on in the fellas head, and sometimes it can get rather dark, the idea of wanting to do unspeakable things to the girl who is singing for you and only you, I mean there is nobody else around me so I must be the protagonist for this show. This is my stage, my world and my life, and they are singing for me and this is my time. \n And contrast that with the singer, who is upset at the weather, the crowd is thinning and there is barely anyone watching us. This is prime time for everyone to watch, it's around the time where everyone is walking home to the station and is the perfect time to catch people's attention, but the weather had to scare everyone away, and now the only audience is some crazy looking homeless fella who keeps staring at me. Ah man, I guess we play our best to this small audience, create the best experience for them and we can call that a victory.",
        "tags": []
    },
    {
        "id": 13,
        "title": "Death in the Family",
        "content": "I wish things would just go back to normal, I wish I could just go back to a time where I didn't have to deal with this. I wish I didn't have to deal with this. \n People treat me different nowadays, they treat me as with the kind of respect they give to pets and they allow them some space for themselves, feeling sorry for me but never doing anything to treat the saddness. They'll tell me they're so sorry it happened to me, I'm so young and that nobody has to go through this… but these sweet nothings change not a single thing. I'm not able to join conversations without it being swayed back to me, people watch what they say in order not to offend or are afraid of what it might do to me, it only isolates me more because they'll never treat me the same way again. I feel like an outsider by the way they avoid conversations, like an outcast who they cannot relate to anymore, like a child they have to worry about all the time. I feel like a liability, like someone who is too much to handle, but I'm not even sure how I feel to begin with. \n I didn't care too much when he died, you could say I was sad but I think I could live with him not being around, but it was the dynamic change that I was not prepared for. Mum could not possibly handle dad leaving so early, and mum would spend hours crying or lying in bed, so the rest of us had to take care of things. Cleaning the house, making sure clothes are washed, brushing and mopping the floor, buying, cooking and cleaning afterwards. Sometimes I would feel too overwhelmed by mum's emotions that even I felt paralysed at times. The people that I looked up to not being able to handle this scared me, I'm not even sure what to think about that.",
        "tags": [
            "observations", 
            "not me",
            "death"
        ]
    },
    {
        "id": 14,
        "title": "A Letter from the Insane One ",
        "content": "I write this because I'm not sure anymore. I don't remember how we met, but apparently we are related and I am her father. Theres a sense of reliance, a sense of responsibility that I have when I'm around her, but this is a feeling that she is dumping on me, and not something that I believe is accurate, let alone justified. She is just a stranger to me, in essence, but I rely on her to keep me company and she explains the person I used to be, but the way she describes me doesn't sound great, and isn't something to be proud of. I don't care what I used to be, why must she pigeon hole me into this idea, this monstrosity of undesirable personalities and traits. I realise I have this opportunity to make amends to my past self, but is this even my past self if I don't remember it, and is just being built from the memory of someone close to me? I've thought about this a lot because it bothers me, her idea of me is real but it doesn't exist anymore, is it fair to push this onto the person who has only contains the same body? This person exists in her head, I don't think it's fair.",
        "tags": [
            "OC"
        ]
    },
    {
        "id": 15,
        "title": "Family Feuds",
        "content": "The stiffness in the air from the pain of a lost opportunity that never existed fills the air. The solitude desired from the son and the warmth and love that the mum just wants to provide, hurting both. The pain of not understanding each other but so dearly wanting to. The music softly attempting to settle the mood, only creating roots of terrible memories associated with the soft piano and strings, the time I shouted at my mum and didn't listen to what she had to say, or the time I tried to help my son and he takes me for granted. A love so fragile and incompatible, yet expected and unconditional. \n Slow realisation of the moment, and bringing down the walls for conversation without emotion, without jumping too fast to conclusions, we settle back to a distance where we feel comfortable.",
        "tags": [
            "not me",
            "observations"
        ]
    },
    {
        "id": 16,
        "title": "Slow Night",
        "content": "A day full of empty nothings, a day full of light tappings into electronic signals displayed as tiny little lights on a wide box, floating on a wooden contraption designed to hold things. Too much time to think, but never enough time to do the things I want. The battle of the mind, or perhaps a battle of conflicting desires; the desire to become something better, and the desire to just enjoy the small things of life. If this isn't the reason for living, then call me a fraud.",
        "tags": [
            "bored"
        ]
    }
]